Roberto-Rod/OCC_Main/Pico2/PP-main/test/unit_test/test_helpers/pic16lf1509_actual.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
// BAUDCON<ABDEN>
extern volatile __bit                   ABDEN               __at(0xCF8);	// @ (0x19F * 8 + 0)
#define                                 ABDEN_bit           BANKMASK(BAUDCON), 0
// BAUDCON<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0xCFF);	// @ (0x19F * 8 + 7)
#define                                 ABDOVF_bit          BANKMASK(BAUDCON), 7
// SSP1CON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x10B5);	// @ (0x216 * 8 + 5)
#define                                 ACKDT_bit           BANKMASK(SSP1CON2), 5
// SSP1CON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x10B4);	// @ (0x216 * 8 + 4)
#define                                 ACKEN_bit           BANKMASK(SSP1CON2), 4
// SSP1CON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x10B6);	// @ (0x216 * 8 + 6)
#define                                 ACKSTAT_bit         BANKMASK(SSP1CON2), 6
// SSP1CON3<ACKTIM>
extern volatile __bit                   ACKTIM              __at(0x10BF);	// @ (0x217 * 8 + 7)
#define                                 ACKTIM_bit          BANKMASK(SSP1CON3), 7
// RCSTA<ADDEN>
extern volatile __bit                   ADDEN               __at(0xCEB);	// @ (0x19D * 8 + 3)
#define                                 ADDEN_bit           BANKMASK(RCSTA), 3
// ADCON1<ADFM>
extern volatile __bit                   ADFM                __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 ADFM_bit            BANKMASK(ADCON1), 7
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 ADFVR0_bit          BANKMASK(FVRCON), 0
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 ADFVR1_bit          BANKMASK(FVRCON), 1
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADGO_bit            BANKMASK(ADCON0), 1
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ADIE_bit            BANKMASK(PIE1), 6
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 ADIF_bit            BANKMASK(PIR1), 6
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ADON_bit            BANKMASK(ADCON0), 0
// ADCON1<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 ADPREF0_bit         BANKMASK(ADCON1), 0
// ADCON1<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 ADPREF1_bit         BANKMASK(ADCON1), 1
// SSP1CON3<AHEN>
extern volatile __bit                   AHEN                __at(0x10B9);	// @ (0x217 * 8 + 1)
#define                                 AHEN_bit            BANKMASK(SSP1CON3), 1
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 ANSA0_bit           BANKMASK(ANSELA), 0
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 ANSA1_bit           BANKMASK(ANSELA), 1
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 ANSA2_bit           BANKMASK(ANSELA), 2
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 ANSA4_bit           BANKMASK(ANSELA), 4
// ANSELB<ANSB4>
extern volatile __bit                   ANSB4               __at(0xC6C);	// @ (0x18D * 8 + 4)
#define                                 ANSB4_bit           BANKMASK(ANSELB), 4
// ANSELB<ANSB5>
extern volatile __bit                   ANSB5               __at(0xC6D);	// @ (0x18D * 8 + 5)
#define                                 ANSB5_bit           BANKMASK(ANSELB), 5
// ANSELC<ANSC0>
extern volatile __bit                   ANSC0               __at(0xC70);	// @ (0x18E * 8 + 0)
#define                                 ANSC0_bit           BANKMASK(ANSELC), 0
// ANSELC<ANSC1>
extern volatile __bit                   ANSC1               __at(0xC71);	// @ (0x18E * 8 + 1)
#define                                 ANSC1_bit           BANKMASK(ANSELC), 1
// ANSELC<ANSC2>
extern volatile __bit                   ANSC2               __at(0xC72);	// @ (0x18E * 8 + 2)
#define                                 ANSC2_bit           BANKMASK(ANSELC), 2
// ANSELC<ANSC3>
extern volatile __bit                   ANSC3               __at(0xC73);	// @ (0x18E * 8 + 3)
#define                                 ANSC3_bit           BANKMASK(ANSELC), 3
// ANSELC<ANSC6>
extern volatile __bit                   ANSC6               __at(0xC76);	// @ (0x18E * 8 + 6)
#define                                 ANSC6_bit           BANKMASK(ANSELC), 6
// ANSELC<ANSC7>
extern volatile __bit                   ANSC7               __at(0xC77);	// @ (0x18E * 8 + 7)
#define                                 ANSC7_bit           BANKMASK(ANSELC), 7
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 BCL1IE_bit          BANKMASK(PIE2), 3
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 BCL1IF_bit          BANKMASK(PIR2), 3
// SSP1STAT<BF>
extern volatile __bit                   BF                  __at(0x10A0);	// @ (0x214 * 8 + 0)
#define                                 BF_bit              BANKMASK(SSP1STAT), 0
// ICDBK0L<BKA0>
extern volatile __bit                   BKA0                __at(0x7CE8);	// @ (0xF9D * 8 + 0)
#define                                 BKA0_bit            BANKMASK(ICDBK0L), 0
// ICDBK0L<BKA1>
extern volatile __bit                   BKA1                __at(0x7CE9);	// @ (0xF9D * 8 + 1)
#define                                 BKA1_bit            BANKMASK(ICDBK0L), 1
// ICDBK0H<BKA10>
extern volatile __bit                   BKA10               __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 BKA10_bit           BANKMASK(ICDBK0H), 2
// ICDBK0H<BKA11>
extern volatile __bit                   BKA11               __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 BKA11_bit           BANKMASK(ICDBK0H), 3
// ICDBK0H<BKA12>
extern volatile __bit                   BKA12               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 BKA12_bit           BANKMASK(ICDBK0H), 4
// ICDBK0H<BKA13>
extern volatile __bit                   BKA13               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 BKA13_bit           BANKMASK(ICDBK0H), 5
// ICDBK0H<BKA14>
extern volatile __bit                   BKA14               __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 BKA14_bit           BANKMASK(ICDBK0H), 6
// ICDBK0L<BKA2>
extern volatile __bit                   BKA2                __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 BKA2_bit            BANKMASK(ICDBK0L), 2
// ICDBK0L<BKA3>
extern volatile __bit                   BKA3                __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 BKA3_bit            BANKMASK(ICDBK0L), 3
// ICDBK0L<BKA4>
extern volatile __bit                   BKA4                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 BKA4_bit            BANKMASK(ICDBK0L), 4
// ICDBK0L<BKA5>
extern volatile __bit                   BKA5                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 BKA5_bit            BANKMASK(ICDBK0L), 5
// ICDBK0L<BKA6>
extern volatile __bit                   BKA6                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 BKA6_bit            BANKMASK(ICDBK0L), 6
// ICDBK0L<BKA7>
extern volatile __bit                   BKA7                __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 BKA7_bit            BANKMASK(ICDBK0L), 7
// ICDBK0H<BKA8>
extern volatile __bit                   BKA8                __at(0x7CF0);	// @ (0xF9E * 8 + 0)
#define                                 BKA8_bit            BANKMASK(ICDBK0H), 0
// ICDBK0H<BKA9>
extern volatile __bit                   BKA9                __at(0x7CF1);	// @ (0xF9E * 8 + 1)
#define                                 BKA9_bit            BANKMASK(ICDBK0H), 1
// ICDBK0CON<BKEN>
extern volatile __bit                   BKEN                __at(0x7CE7);	// @ (0xF9C * 8 + 7)
#define                                 BKEN_bit            BANKMASK(ICDBK0CON), 7
// ICDBK0CON<BKHLT>
extern volatile __bit                   BKHLT               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 BKHLT_bit           BANKMASK(ICDBK0CON), 0
// SSP1CON3<BOEN>
extern volatile __bit                   BOEN                __at(0x10BC);	// @ (0x217 * 8 + 4)
#define                                 BOEN_bit            BANKMASK(SSP1CON3), 4
// BORCON<BORFS>
extern volatile __bit                   BORFS               __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 BORFS_bit           BANKMASK(BORCON), 6
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 BORRDY_bit          BANKMASK(BORCON), 0
// BAUDCON<BRG16>
extern volatile __bit                   BRG16               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 BRG16_bit           BANKMASK(BAUDCON), 3
// TXSTA<BRGH>
extern volatile __bit                   BRGH                __at(0xCF2);	// @ (0x19E * 8 + 2)
#define                                 BRGH_bit            BANKMASK(TXSTA), 2
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            BANKMASK(BSR), 0
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            BANKMASK(BSR), 1
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            BANKMASK(BSR), 2
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            BANKMASK(BSR), 3
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            BANKMASK(BSR), 4
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 C1HYS_bit           BANKMASK(CM1CON0), 1
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x495);	// @ (0x92 * 8 + 5)
#define                                 C1IE_bit            BANKMASK(PIE2), 5
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 C1IF_bit            BANKMASK(PIR2), 5
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x896);	// @ (0x112 * 8 + 6)
#define                                 C1INTN_bit          BANKMASK(CM1CON1), 6
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 C1INTP_bit          BANKMASK(CM1CON1), 7
// CM1CON1<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 C1NCH0_bit          BANKMASK(CM1CON1), 0
// CM1CON1<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 C1NCH1_bit          BANKMASK(CM1CON1), 1
// CM1CON1<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 C1NCH2_bit          BANKMASK(CM1CON1), 2
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 C1OE_bit            BANKMASK(CM1CON0), 5
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 C1ON_bit            BANKMASK(CM1CON0), 7
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 C1OUT_bit           BANKMASK(CM1CON0), 6
// CM1CON1<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 C1PCH0_bit          BANKMASK(CM1CON1), 4
// CM1CON1<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 C1PCH1_bit          BANKMASK(CM1CON1), 5
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 C1POL_bit           BANKMASK(CM1CON0), 4
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 C1SP_bit            BANKMASK(CM1CON0), 2
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 C1SYNC_bit          BANKMASK(CM1CON0), 0
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 C2HYS_bit           BANKMASK(CM2CON0), 1
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 C2IE_bit            BANKMASK(PIE2), 6
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 C2IF_bit            BANKMASK(PIR2), 6
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x8A6);	// @ (0x114 * 8 + 6)
#define                                 C2INTN_bit          BANKMASK(CM2CON1), 6
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x8A7);	// @ (0x114 * 8 + 7)
#define                                 C2INTP_bit          BANKMASK(CM2CON1), 7
// CM2CON1<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 C2NCH0_bit          BANKMASK(CM2CON1), 0
// CM2CON1<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 C2NCH1_bit          BANKMASK(CM2CON1), 1
// CM2CON1<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 C2NCH2_bit          BANKMASK(CM2CON1), 2
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x89D);	// @ (0x113 * 8 + 5)
#define                                 C2OE_bit            BANKMASK(CM2CON0), 5
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 C2ON_bit            BANKMASK(CM2CON0), 7
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x89E);	// @ (0x113 * 8 + 6)
#define                                 C2OUT_bit           BANKMASK(CM2CON0), 6
// CM2CON1<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 C2PCH0_bit          BANKMASK(CM2CON1), 4
// CM2CON1<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x8A5);	// @ (0x114 * 8 + 5)
#define                                 C2PCH1_bit          BANKMASK(CM2CON1), 5
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x89C);	// @ (0x113 * 8 + 4)
#define                                 C2POL_bit           BANKMASK(CM2CON0), 4
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 C2SP_bit            BANKMASK(CM2CON0), 2
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 C2SYNC_bit          BANKMASK(CM2CON0), 0
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           BANKMASK(STATUS), 0
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 CDAFVR0_bit         BANKMASK(FVRCON), 2
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 CDAFVR1_bit         BANKMASK(FVRCON), 3
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            BANKMASK(PMCON1), 6
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            BANKMASK(ADCON0), 2
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            BANKMASK(ADCON0), 3
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            BANKMASK(ADCON0), 4
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            BANKMASK(ADCON0), 5
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            BANKMASK(ADCON0), 6
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             BANKMASK(SSP1STAT), 6
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             BANKMASK(SSP1CON1), 4
// PIE3<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLC1IE_bit          BANKMASK(PIE3), 0
// PIR3<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 CLC1IF_bit          BANKMASK(PIR3), 0
// APFCON<CLC1SEL>
extern volatile __bit                   CLC1SEL             __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 CLC1SEL_bit         BANKMASK(APFCON), 1
// PIE3<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLC2IE_bit          BANKMASK(PIE3), 1
// PIR3<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 CLC2IF_bit          BANKMASK(PIR3), 1
// PIE3<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLC3IE_bit          BANKMASK(PIE3), 2
// PIR3<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 CLC3IF_bit          BANKMASK(PIR3), 2
// PIE3<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 CLC4IE_bit          BANKMASK(PIE3), 3
// PIR3<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x9B);	// @ (0x13 * 8 + 3)
#define                                 CLC4IF_bit          BANKMASK(PIR3), 3
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            BANKMASK(RCSTA), 4
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            BANKMASK(TXSTA), 7
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 CWG1DBF0_bit        BANKMASK(CWG1DBF), 0
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 CWG1DBF1_bit        BANKMASK(CWG1DBF), 1
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 CWG1DBF2_bit        BANKMASK(CWG1DBF), 2
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 CWG1DBF3_bit        BANKMASK(CWG1DBF), 3
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 CWG1DBF4_bit        BANKMASK(CWG1DBF), 4
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 CWG1DBF5_bit        BANKMASK(CWG1DBF), 5
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 CWG1DBR0_bit        BANKMASK(CWG1DBR), 0
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 CWG1DBR1_bit        BANKMASK(CWG1DBR), 1
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 CWG1DBR2_bit        BANKMASK(CWG1DBR), 2
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x348B);	// @ (0x691 * 8 + 3)
