Roberto-Rod/OCC_Main/Pico2/PP-main/test/unit_test/test_helpers/pic16lf1509_actual.h
extern volatile __bit                   LAT_ICDDAT          __at(0x7C65);	// @ (0xF8C * 8 + 5)
#define                                 LAT_ICDDAT_bit      BANKMASK(ICDIO), 5
// CLC1SEL0<LC1D1S0>
extern volatile __bit                   LC1D1S0             __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 LC1D1S0_bit         BANKMASK(CLC1SEL0), 0
// CLC1SEL0<LC1D1S1>
extern volatile __bit                   LC1D1S1             __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 LC1D1S1_bit         BANKMASK(CLC1SEL0), 1
// CLC1SEL0<LC1D1S2>
extern volatile __bit                   LC1D1S2             __at(0x7892);	// @ (0xF12 * 8 + 2)
#define                                 LC1D1S2_bit         BANKMASK(CLC1SEL0), 2
// CLC1SEL0<LC1D2S0>
extern volatile __bit                   LC1D2S0             __at(0x7894);	// @ (0xF12 * 8 + 4)
#define                                 LC1D2S0_bit         BANKMASK(CLC1SEL0), 4
// CLC1SEL0<LC1D2S1>
extern volatile __bit                   LC1D2S1             __at(0x7895);	// @ (0xF12 * 8 + 5)
#define                                 LC1D2S1_bit         BANKMASK(CLC1SEL0), 5
// CLC1SEL0<LC1D2S2>
extern volatile __bit                   LC1D2S2             __at(0x7896);	// @ (0xF12 * 8 + 6)
#define                                 LC1D2S2_bit         BANKMASK(CLC1SEL0), 6
// CLC1SEL1<LC1D3S0>
extern volatile __bit                   LC1D3S0             __at(0x7898);	// @ (0xF13 * 8 + 0)
#define                                 LC1D3S0_bit         BANKMASK(CLC1SEL1), 0
// CLC1SEL1<LC1D3S1>
extern volatile __bit                   LC1D3S1             __at(0x7899);	// @ (0xF13 * 8 + 1)
#define                                 LC1D3S1_bit         BANKMASK(CLC1SEL1), 1
// CLC1SEL1<LC1D3S2>
extern volatile __bit                   LC1D3S2             __at(0x789A);	// @ (0xF13 * 8 + 2)
#define                                 LC1D3S2_bit         BANKMASK(CLC1SEL1), 2
// CLC1SEL1<LC1D4S0>
extern volatile __bit                   LC1D4S0             __at(0x789C);	// @ (0xF13 * 8 + 4)
#define                                 LC1D4S0_bit         BANKMASK(CLC1SEL1), 4
// CLC1SEL1<LC1D4S1>
extern volatile __bit                   LC1D4S1             __at(0x789D);	// @ (0xF13 * 8 + 5)
#define                                 LC1D4S1_bit         BANKMASK(CLC1SEL1), 5
// CLC1SEL1<LC1D4S2>
extern volatile __bit                   LC1D4S2             __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 LC1D4S2_bit         BANKMASK(CLC1SEL1), 6
// CLC1CON<LC1EN>
extern volatile __bit                   LC1EN               __at(0x7887);	// @ (0xF10 * 8 + 7)
#define                                 LC1EN_bit           BANKMASK(CLC1CON), 7
// CLC1GLS0<LC1G1D1N>
extern volatile __bit                   LC1G1D1N            __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 LC1G1D1N_bit        BANKMASK(CLC1GLS0), 0
// CLC1GLS0<LC1G1D1T>
extern volatile __bit                   LC1G1D1T            __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 LC1G1D1T_bit        BANKMASK(CLC1GLS0), 1
// CLC1GLS0<LC1G1D2N>
extern volatile __bit                   LC1G1D2N            __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 LC1G1D2N_bit        BANKMASK(CLC1GLS0), 2
// CLC1GLS0<LC1G1D2T>
extern volatile __bit                   LC1G1D2T            __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 LC1G1D2T_bit        BANKMASK(CLC1GLS0), 3
// CLC1GLS0<LC1G1D3N>
extern volatile __bit                   LC1G1D3N            __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 LC1G1D3N_bit        BANKMASK(CLC1GLS0), 4
// CLC1GLS0<LC1G1D3T>
extern volatile __bit                   LC1G1D3T            __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 LC1G1D3T_bit        BANKMASK(CLC1GLS0), 5
// CLC1GLS0<LC1G1D4N>
extern volatile __bit                   LC1G1D4N            __at(0x78A6);	// @ (0xF14 * 8 + 6)
#define                                 LC1G1D4N_bit        BANKMASK(CLC1GLS0), 6
// CLC1GLS0<LC1G1D4T>
extern volatile __bit                   LC1G1D4T            __at(0x78A7);	// @ (0xF14 * 8 + 7)
#define                                 LC1G1D4T_bit        BANKMASK(CLC1GLS0), 7
// CLC1POL<LC1G1POL>
extern volatile __bit                   LC1G1POL            __at(0x7888);	// @ (0xF11 * 8 + 0)
#define                                 LC1G1POL_bit        BANKMASK(CLC1POL), 0
// CLC1GLS1<LC1G2D1N>
extern volatile __bit                   LC1G2D1N            __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 LC1G2D1N_bit        BANKMASK(CLC1GLS1), 0
// CLC1GLS1<LC1G2D1T>
extern volatile __bit                   LC1G2D1T            __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 LC1G2D1T_bit        BANKMASK(CLC1GLS1), 1
// CLC1GLS1<LC1G2D2N>
extern volatile __bit                   LC1G2D2N            __at(0x78AA);	// @ (0xF15 * 8 + 2)
#define                                 LC1G2D2N_bit        BANKMASK(CLC1GLS1), 2
// CLC1GLS1<LC1G2D2T>
extern volatile __bit                   LC1G2D2T            __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 LC1G2D2T_bit        BANKMASK(CLC1GLS1), 3
// CLC1GLS1<LC1G2D3N>
extern volatile __bit                   LC1G2D3N            __at(0x78AC);	// @ (0xF15 * 8 + 4)
#define                                 LC1G2D3N_bit        BANKMASK(CLC1GLS1), 4
// CLC1GLS1<LC1G2D3T>
extern volatile __bit                   LC1G2D3T            __at(0x78AD);	// @ (0xF15 * 8 + 5)
#define                                 LC1G2D3T_bit        BANKMASK(CLC1GLS1), 5
// CLC1GLS1<LC1G2D4N>
extern volatile __bit                   LC1G2D4N            __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 LC1G2D4N_bit        BANKMASK(CLC1GLS1), 6
// CLC1GLS1<LC1G2D4T>
extern volatile __bit                   LC1G2D4T            __at(0x78AF);	// @ (0xF15 * 8 + 7)
#define                                 LC1G2D4T_bit        BANKMASK(CLC1GLS1), 7
// CLC1POL<LC1G2POL>
extern volatile __bit                   LC1G2POL            __at(0x7889);	// @ (0xF11 * 8 + 1)
#define                                 LC1G2POL_bit        BANKMASK(CLC1POL), 1
// CLC1GLS2<LC1G3D1N>
extern volatile __bit                   LC1G3D1N            __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 LC1G3D1N_bit        BANKMASK(CLC1GLS2), 0
// CLC1GLS2<LC1G3D1T>
extern volatile __bit                   LC1G3D1T            __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 LC1G3D1T_bit        BANKMASK(CLC1GLS2), 1
// CLC1GLS2<LC1G3D2N>
extern volatile __bit                   LC1G3D2N            __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 LC1G3D2N_bit        BANKMASK(CLC1GLS2), 2
// CLC1GLS2<LC1G3D2T>
extern volatile __bit                   LC1G3D2T            __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 LC1G3D2T_bit        BANKMASK(CLC1GLS2), 3
// CLC1GLS2<LC1G3D3N>
extern volatile __bit                   LC1G3D3N            __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 LC1G3D3N_bit        BANKMASK(CLC1GLS2), 4
// CLC1GLS2<LC1G3D3T>
extern volatile __bit                   LC1G3D3T            __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 LC1G3D3T_bit        BANKMASK(CLC1GLS2), 5
// CLC1GLS2<LC1G3D4N>
extern volatile __bit                   LC1G3D4N            __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 LC1G3D4N_bit        BANKMASK(CLC1GLS2), 6
// CLC1GLS2<LC1G3D4T>
extern volatile __bit                   LC1G3D4T            __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 LC1G3D4T_bit        BANKMASK(CLC1GLS2), 7
// CLC1POL<LC1G3POL>
extern volatile __bit                   LC1G3POL            __at(0x788A);	// @ (0xF11 * 8 + 2)
#define                                 LC1G3POL_bit        BANKMASK(CLC1POL), 2
// CLC1GLS3<LC1G4D1N>
extern volatile __bit                   LC1G4D1N            __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 LC1G4D1N_bit        BANKMASK(CLC1GLS3), 0
// CLC1GLS3<LC1G4D1T>
extern volatile __bit                   LC1G4D1T            __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 LC1G4D1T_bit        BANKMASK(CLC1GLS3), 1
// CLC1GLS3<LC1G4D2N>
extern volatile __bit                   LC1G4D2N            __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 LC1G4D2N_bit        BANKMASK(CLC1GLS3), 2
// CLC1GLS3<LC1G4D2T>
extern volatile __bit                   LC1G4D2T            __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 LC1G4D2T_bit        BANKMASK(CLC1GLS3), 3
// CLC1GLS3<LC1G4D3N>
extern volatile __bit                   LC1G4D3N            __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 LC1G4D3N_bit        BANKMASK(CLC1GLS3), 4
// CLC1GLS3<LC1G4D3T>
extern volatile __bit                   LC1G4D3T            __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 LC1G4D3T_bit        BANKMASK(CLC1GLS3), 5
// CLC1GLS3<LC1G4D4N>
extern volatile __bit                   LC1G4D4N            __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 LC1G4D4N_bit        BANKMASK(CLC1GLS3), 6
// CLC1GLS3<LC1G4D4T>
extern volatile __bit                   LC1G4D4T            __at(0x78BF);	// @ (0xF17 * 8 + 7)
#define                                 LC1G4D4T_bit        BANKMASK(CLC1GLS3), 7
// CLC1POL<LC1G4POL>
extern volatile __bit                   LC1G4POL            __at(0x788B);	// @ (0xF11 * 8 + 3)
#define                                 LC1G4POL_bit        BANKMASK(CLC1POL), 3
// CLC1CON<LC1INTN>
extern volatile __bit                   LC1INTN             __at(0x7883);	// @ (0xF10 * 8 + 3)
#define                                 LC1INTN_bit         BANKMASK(CLC1CON), 3
// CLC1CON<LC1INTP>
extern volatile __bit                   LC1INTP             __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 LC1INTP_bit         BANKMASK(CLC1CON), 4
// CLC1CON<LC1MODE0>
extern volatile __bit                   LC1MODE0            __at(0x7880);	// @ (0xF10 * 8 + 0)
#define                                 LC1MODE0_bit        BANKMASK(CLC1CON), 0
// CLC1CON<LC1MODE1>
extern volatile __bit                   LC1MODE1            __at(0x7881);	// @ (0xF10 * 8 + 1)
#define                                 LC1MODE1_bit        BANKMASK(CLC1CON), 1
// CLC1CON<LC1MODE2>
extern volatile __bit                   LC1MODE2            __at(0x7882);	// @ (0xF10 * 8 + 2)
#define                                 LC1MODE2_bit        BANKMASK(CLC1CON), 2
// CLC1CON<LC1OE>
extern volatile __bit                   LC1OE               __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 LC1OE_bit           BANKMASK(CLC1CON), 6
// CLC1CON<LC1OUT>
extern volatile __bit                   LC1OUT              __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 LC1OUT_bit          BANKMASK(CLC1CON), 5
// CLC1POL<LC1POL>
extern volatile __bit                   LC1POL              __at(0x788F);	// @ (0xF11 * 8 + 7)
#define                                 LC1POL_bit          BANKMASK(CLC1POL), 7
// CLC2SEL0<LC2D1S0>
extern volatile __bit                   LC2D1S0             __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 LC2D1S0_bit         BANKMASK(CLC2SEL0), 0
// CLC2SEL0<LC2D1S1>
extern volatile __bit                   LC2D1S1             __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 LC2D1S1_bit         BANKMASK(CLC2SEL0), 1
// CLC2SEL0<LC2D1S2>
extern volatile __bit                   LC2D1S2             __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 LC2D1S2_bit         BANKMASK(CLC2SEL0), 2
// CLC2SEL0<LC2D2S0>
extern volatile __bit                   LC2D2S0             __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 LC2D2S0_bit         BANKMASK(CLC2SEL0), 4
// CLC2SEL0<LC2D2S1>
extern volatile __bit                   LC2D2S1             __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 LC2D2S1_bit         BANKMASK(CLC2SEL0), 5
// CLC2SEL0<LC2D2S2>
extern volatile __bit                   LC2D2S2             __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 LC2D2S2_bit         BANKMASK(CLC2SEL0), 6
// CLC2SEL1<LC2D3S0>
extern volatile __bit                   LC2D3S0             __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 LC2D3S0_bit         BANKMASK(CLC2SEL1), 0
// CLC2SEL1<LC2D3S1>
extern volatile __bit                   LC2D3S1             __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 LC2D3S1_bit         BANKMASK(CLC2SEL1), 1
// CLC2SEL1<LC2D3S2>
extern volatile __bit                   LC2D3S2             __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 LC2D3S2_bit         BANKMASK(CLC2SEL1), 2
// CLC2SEL1<LC2D4S0>
extern volatile __bit                   LC2D4S0             __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 LC2D4S0_bit         BANKMASK(CLC2SEL1), 4
// CLC2SEL1<LC2D4S1>
extern volatile __bit                   LC2D4S1             __at(0x78DD);	// @ (0xF1B * 8 + 5)
#define                                 LC2D4S1_bit         BANKMASK(CLC2SEL1), 5
// CLC2SEL1<LC2D4S2>
extern volatile __bit                   LC2D4S2             __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 LC2D4S2_bit         BANKMASK(CLC2SEL1), 6
// CLC2CON<LC2EN>
extern volatile __bit                   LC2EN               __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 LC2EN_bit           BANKMASK(CLC2CON), 7
// CLC2GLS0<LC2G1D1N>
extern volatile __bit                   LC2G1D1N            __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 LC2G1D1N_bit        BANKMASK(CLC2GLS0), 0
// CLC2GLS0<LC2G1D1T>
extern volatile __bit                   LC2G1D1T            __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 LC2G1D1T_bit        BANKMASK(CLC2GLS0), 1
// CLC2GLS0<LC2G1D2N>
extern volatile __bit                   LC2G1D2N            __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 LC2G1D2N_bit        BANKMASK(CLC2GLS0), 2
// CLC2GLS0<LC2G1D2T>
extern volatile __bit                   LC2G1D2T            __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 LC2G1D2T_bit        BANKMASK(CLC2GLS0), 3
// CLC2GLS0<LC2G1D3N>
extern volatile __bit                   LC2G1D3N            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 LC2G1D3N_bit        BANKMASK(CLC2GLS0), 4
// CLC2GLS0<LC2G1D3T>
extern volatile __bit                   LC2G1D3T            __at(0x78E5);	// @ (0xF1C * 8 + 5)
#define                                 LC2G1D3T_bit        BANKMASK(CLC2GLS0), 5
// CLC2GLS0<LC2G1D4N>
extern volatile __bit                   LC2G1D4N            __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 LC2G1D4N_bit        BANKMASK(CLC2GLS0), 6
// CLC2GLS0<LC2G1D4T>
extern volatile __bit                   LC2G1D4T            __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 LC2G1D4T_bit        BANKMASK(CLC2GLS0), 7
// CLC2POL<LC2G1POL>
extern volatile __bit                   LC2G1POL            __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 LC2G1POL_bit        BANKMASK(CLC2POL), 0
// CLC2GLS1<LC2G2D1N>
extern volatile __bit                   LC2G2D1N            __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 LC2G2D1N_bit        BANKMASK(CLC2GLS1), 0
// CLC2GLS1<LC2G2D1T>
extern volatile __bit                   LC2G2D1T            __at(0x78E9);	// @ (0xF1D * 8 + 1)
#define                                 LC2G2D1T_bit        BANKMASK(CLC2GLS1), 1
// CLC2GLS1<LC2G2D2N>
extern volatile __bit                   LC2G2D2N            __at(0x78EA);	// @ (0xF1D * 8 + 2)
#define                                 LC2G2D2N_bit        BANKMASK(CLC2GLS1), 2
// CLC2GLS1<LC2G2D2T>
extern volatile __bit                   LC2G2D2T            __at(0x78EB);	// @ (0xF1D * 8 + 3)
#define                                 LC2G2D2T_bit        BANKMASK(CLC2GLS1), 3
// CLC2GLS1<LC2G2D3N>
extern volatile __bit                   LC2G2D3N            __at(0x78EC);	// @ (0xF1D * 8 + 4)
#define                                 LC2G2D3N_bit        BANKMASK(CLC2GLS1), 4
// CLC2GLS1<LC2G2D3T>
extern volatile __bit                   LC2G2D3T            __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 LC2G2D3T_bit        BANKMASK(CLC2GLS1), 5
// CLC2GLS1<LC2G2D4N>
extern volatile __bit                   LC2G2D4N            __at(0x78EE);	// @ (0xF1D * 8 + 6)
#define                                 LC2G2D4N_bit        BANKMASK(CLC2GLS1), 6
// CLC2GLS1<LC2G2D4T>
extern volatile __bit                   LC2G2D4T            __at(0x78EF);	// @ (0xF1D * 8 + 7)
#define                                 LC2G2D4T_bit        BANKMASK(CLC2GLS1), 7
// CLC2POL<LC2G2POL>
extern volatile __bit                   LC2G2POL            __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 LC2G2POL_bit        BANKMASK(CLC2POL), 1
// CLC2GLS2<LC2G3D1N>
extern volatile __bit                   LC2G3D1N            __at(0x78F0);	// @ (0xF1E * 8 + 0)
#define                                 LC2G3D1N_bit        BANKMASK(CLC2GLS2), 0
// CLC2GLS2<LC2G3D1T>
extern volatile __bit                   LC2G3D1T            __at(0x78F1);	// @ (0xF1E * 8 + 1)
#define                                 LC2G3D1T_bit        BANKMASK(CLC2GLS2), 1
// CLC2GLS2<LC2G3D2N>
extern volatile __bit                   LC2G3D2N            __at(0x78F2);	// @ (0xF1E * 8 + 2)
#define                                 LC2G3D2N_bit        BANKMASK(CLC2GLS2), 2
// CLC2GLS2<LC2G3D2T>
extern volatile __bit                   LC2G3D2T            __at(0x78F3);	// @ (0xF1E * 8 + 3)
#define                                 LC2G3D2T_bit        BANKMASK(CLC2GLS2), 3
// CLC2GLS2<LC2G3D3N>
extern volatile __bit                   LC2G3D3N            __at(0x78F4);	// @ (0xF1E * 8 + 4)
#define                                 LC2G3D3N_bit        BANKMASK(CLC2GLS2), 4
// CLC2GLS2<LC2G3D3T>
extern volatile __bit                   LC2G3D3T            __at(0x78F5);	// @ (0xF1E * 8 + 5)
#define                                 LC2G3D3T_bit        BANKMASK(CLC2GLS2), 5
// CLC2GLS2<LC2G3D4N>
extern volatile __bit                   LC2G3D4N            __at(0x78F6);	// @ (0xF1E * 8 + 6)
#define                                 LC2G3D4N_bit        BANKMASK(CLC2GLS2), 6
// CLC2GLS2<LC2G3D4T>
extern volatile __bit                   LC2G3D4T            __at(0x78F7);	// @ (0xF1E * 8 + 7)
#define                                 LC2G3D4T_bit        BANKMASK(CLC2GLS2), 7
// CLC2POL<LC2G3POL>
extern volatile __bit                   LC2G3POL            __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 LC2G3POL_bit        BANKMASK(CLC2POL), 2
// CLC2GLS3<LC2G4D1N>
extern volatile __bit                   LC2G4D1N            __at(0x78F8);	// @ (0xF1F * 8 + 0)
#define                                 LC2G4D1N_bit        BANKMASK(CLC2GLS3), 0
// CLC2GLS3<LC2G4D1T>
extern volatile __bit                   LC2G4D1T            __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 LC2G4D1T_bit        BANKMASK(CLC2GLS3), 1
// CLC2GLS3<LC2G4D2N>
extern volatile __bit                   LC2G4D2N            __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 LC2G4D2N_bit        BANKMASK(CLC2GLS3), 2
// CLC2GLS3<LC2G4D2T>
extern volatile __bit                   LC2G4D2T            __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 LC2G4D2T_bit        BANKMASK(CLC2GLS3), 3
// CLC2GLS3<LC2G4D3N>
extern volatile __bit                   LC2G4D3N            __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 LC2G4D3N_bit        BANKMASK(CLC2GLS3), 4
// CLC2GLS3<LC2G4D3T>
extern volatile __bit                   LC2G4D3T            __at(0x78FD);	// @ (0xF1F * 8 + 5)
#define                                 LC2G4D3T_bit        BANKMASK(CLC2GLS3), 5
// CLC2GLS3<LC2G4D4N>
extern volatile __bit                   LC2G4D4N            __at(0x78FE);	// @ (0xF1F * 8 + 6)
#define                                 LC2G4D4N_bit        BANKMASK(CLC2GLS3), 6
// CLC2GLS3<LC2G4D4T>
extern volatile __bit                   LC2G4D4T            __at(0x78FF);	// @ (0xF1F * 8 + 7)
#define                                 LC2G4D4T_bit        BANKMASK(CLC2GLS3), 7
// CLC2POL<LC2G4POL>
extern volatile __bit                   LC2G4POL            __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 LC2G4POL_bit        BANKMASK(CLC2POL), 3
// CLC2CON<LC2INTN>
extern volatile __bit                   LC2INTN             __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 LC2INTN_bit         BANKMASK(CLC2CON), 3
// CLC2CON<LC2INTP>
extern volatile __bit                   LC2INTP             __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 LC2INTP_bit         BANKMASK(CLC2CON), 4
// CLC2CON<LC2MODE0>
extern volatile __bit                   LC2MODE0            __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 LC2MODE0_bit        BANKMASK(CLC2CON), 0
// CLC2CON<LC2MODE1>
extern volatile __bit                   LC2MODE1            __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 LC2MODE1_bit        BANKMASK(CLC2CON), 1
// CLC2CON<LC2MODE2>
extern volatile __bit                   LC2MODE2            __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 LC2MODE2_bit        BANKMASK(CLC2CON), 2
// CLC2CON<LC2OE>
extern volatile __bit                   LC2OE               __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 LC2OE_bit           BANKMASK(CLC2CON), 6
// CLC2CON<LC2OUT>
extern volatile __bit                   LC2OUT              __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 LC2OUT_bit          BANKMASK(CLC2CON), 5
// CLC2POL<LC2POL>
extern volatile __bit                   LC2POL              __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 LC2POL_bit          BANKMASK(CLC2POL), 7
// CLC3SEL0<LC3D1S0>
extern volatile __bit                   LC3D1S0             __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 LC3D1S0_bit         BANKMASK(CLC3SEL0), 0
// CLC3SEL0<LC3D1S1>
extern volatile __bit                   LC3D1S1             __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 LC3D1S1_bit         BANKMASK(CLC3SEL0), 1
// CLC3SEL0<LC3D1S2>
extern volatile __bit                   LC3D1S2             __at(0x7912);	// @ (0xF22 * 8 + 2)
#define                                 LC3D1S2_bit         BANKMASK(CLC3SEL0), 2
// CLC3SEL0<LC3D2S0>
extern volatile __bit                   LC3D2S0             __at(0x7914);	// @ (0xF22 * 8 + 4)
#define                                 LC3D2S0_bit         BANKMASK(CLC3SEL0), 4
// CLC3SEL0<LC3D2S1>
