Roberto-Rod/OCC_Main/Pico2/PP-main/test/unit_test/test_helpers/pic16lf1509_actual.h
extern volatile __bit                   LC3D2S1             __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 LC3D2S1_bit         BANKMASK(CLC3SEL0), 5
// CLC3SEL0<LC3D2S2>
extern volatile __bit                   LC3D2S2             __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 LC3D2S2_bit         BANKMASK(CLC3SEL0), 6
// CLC3SEL1<LC3D3S0>
extern volatile __bit                   LC3D3S0             __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 LC3D3S0_bit         BANKMASK(CLC3SEL1), 0
// CLC3SEL1<LC3D3S1>
extern volatile __bit                   LC3D3S1             __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 LC3D3S1_bit         BANKMASK(CLC3SEL1), 1
// CLC3SEL1<LC3D3S2>
extern volatile __bit                   LC3D3S2             __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 LC3D3S2_bit         BANKMASK(CLC3SEL1), 2
// CLC3SEL1<LC3D4S0>
extern volatile __bit                   LC3D4S0             __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 LC3D4S0_bit         BANKMASK(CLC3SEL1), 4
// CLC3SEL1<LC3D4S1>
extern volatile __bit                   LC3D4S1             __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 LC3D4S1_bit         BANKMASK(CLC3SEL1), 5
// CLC3SEL1<LC3D4S2>
extern volatile __bit                   LC3D4S2             __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 LC3D4S2_bit         BANKMASK(CLC3SEL1), 6
// CLC3CON<LC3EN>
extern volatile __bit                   LC3EN               __at(0x7907);	// @ (0xF20 * 8 + 7)
#define                                 LC3EN_bit           BANKMASK(CLC3CON), 7
// CLC3GLS0<LC3G1D1N>
extern volatile __bit                   LC3G1D1N            __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 LC3G1D1N_bit        BANKMASK(CLC3GLS0), 0
// CLC3GLS0<LC3G1D1T>
extern volatile __bit                   LC3G1D1T            __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 LC3G1D1T_bit        BANKMASK(CLC3GLS0), 1
// CLC3GLS0<LC3G1D2N>
extern volatile __bit                   LC3G1D2N            __at(0x7922);	// @ (0xF24 * 8 + 2)
#define                                 LC3G1D2N_bit        BANKMASK(CLC3GLS0), 2
// CLC3GLS0<LC3G1D2T>
extern volatile __bit                   LC3G1D2T            __at(0x7923);	// @ (0xF24 * 8 + 3)
#define                                 LC3G1D2T_bit        BANKMASK(CLC3GLS0), 3
// CLC3GLS0<LC3G1D3N>
extern volatile __bit                   LC3G1D3N            __at(0x7924);	// @ (0xF24 * 8 + 4)
#define                                 LC3G1D3N_bit        BANKMASK(CLC3GLS0), 4
// CLC3GLS0<LC3G1D3T>
extern volatile __bit                   LC3G1D3T            __at(0x7925);	// @ (0xF24 * 8 + 5)
#define                                 LC3G1D3T_bit        BANKMASK(CLC3GLS0), 5
// CLC3GLS0<LC3G1D4N>
extern volatile __bit                   LC3G1D4N            __at(0x7926);	// @ (0xF24 * 8 + 6)
#define                                 LC3G1D4N_bit        BANKMASK(CLC3GLS0), 6
// CLC3GLS0<LC3G1D4T>
extern volatile __bit                   LC3G1D4T            __at(0x7927);	// @ (0xF24 * 8 + 7)
#define                                 LC3G1D4T_bit        BANKMASK(CLC3GLS0), 7
// CLC3POL<LC3G1POL>
extern volatile __bit                   LC3G1POL            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 LC3G1POL_bit        BANKMASK(CLC3POL), 0
// CLC3GLS1<LC3G2D1N>
extern volatile __bit                   LC3G2D1N            __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 LC3G2D1N_bit        BANKMASK(CLC3GLS1), 0
// CLC3GLS1<LC3G2D1T>
extern volatile __bit                   LC3G2D1T            __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 LC3G2D1T_bit        BANKMASK(CLC3GLS1), 1
// CLC3GLS1<LC3G2D2N>
extern volatile __bit                   LC3G2D2N            __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 LC3G2D2N_bit        BANKMASK(CLC3GLS1), 2
// CLC3GLS1<LC3G2D2T>
extern volatile __bit                   LC3G2D2T            __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 LC3G2D2T_bit        BANKMASK(CLC3GLS1), 3
// CLC3GLS1<LC3G2D3N>
extern volatile __bit                   LC3G2D3N            __at(0x792C);	// @ (0xF25 * 8 + 4)
#define                                 LC3G2D3N_bit        BANKMASK(CLC3GLS1), 4
// CLC3GLS1<LC3G2D3T>
extern volatile __bit                   LC3G2D3T            __at(0x792D);	// @ (0xF25 * 8 + 5)
#define                                 LC3G2D3T_bit        BANKMASK(CLC3GLS1), 5
// CLC3GLS1<LC3G2D4N>
extern volatile __bit                   LC3G2D4N            __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 LC3G2D4N_bit        BANKMASK(CLC3GLS1), 6
// CLC3GLS1<LC3G2D4T>
extern volatile __bit                   LC3G2D4T            __at(0x792F);	// @ (0xF25 * 8 + 7)
#define                                 LC3G2D4T_bit        BANKMASK(CLC3GLS1), 7
// CLC3POL<LC3G2POL>
extern volatile __bit                   LC3G2POL            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 LC3G2POL_bit        BANKMASK(CLC3POL), 1
// CLC3GLS2<LC3G3D1N>
extern volatile __bit                   LC3G3D1N            __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 LC3G3D1N_bit        BANKMASK(CLC3GLS2), 0
// CLC3GLS2<LC3G3D1T>
extern volatile __bit                   LC3G3D1T            __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 LC3G3D1T_bit        BANKMASK(CLC3GLS2), 1
// CLC3GLS2<LC3G3D2N>
extern volatile __bit                   LC3G3D2N            __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 LC3G3D2N_bit        BANKMASK(CLC3GLS2), 2
// CLC3GLS2<LC3G3D2T>
extern volatile __bit                   LC3G3D2T            __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 LC3G3D2T_bit        BANKMASK(CLC3GLS2), 3
// CLC3GLS2<LC3G3D3N>
extern volatile __bit                   LC3G3D3N            __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 LC3G3D3N_bit        BANKMASK(CLC3GLS2), 4
// CLC3GLS2<LC3G3D3T>
extern volatile __bit                   LC3G3D3T            __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 LC3G3D3T_bit        BANKMASK(CLC3GLS2), 5
// CLC3GLS2<LC3G3D4N>
extern volatile __bit                   LC3G3D4N            __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 LC3G3D4N_bit        BANKMASK(CLC3GLS2), 6
// CLC3GLS2<LC3G3D4T>
extern volatile __bit                   LC3G3D4T            __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 LC3G3D4T_bit        BANKMASK(CLC3GLS2), 7
// CLC3POL<LC3G3POL>
extern volatile __bit                   LC3G3POL            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 LC3G3POL_bit        BANKMASK(CLC3POL), 2
// CLC3GLS3<LC3G4D1N>
extern volatile __bit                   LC3G4D1N            __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 LC3G4D1N_bit        BANKMASK(CLC3GLS3), 0
// CLC3GLS3<LC3G4D1T>
extern volatile __bit                   LC3G4D1T            __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 LC3G4D1T_bit        BANKMASK(CLC3GLS3), 1
// CLC3GLS3<LC3G4D2N>
extern volatile __bit                   LC3G4D2N            __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 LC3G4D2N_bit        BANKMASK(CLC3GLS3), 2
// CLC3GLS3<LC3G4D2T>
extern volatile __bit                   LC3G4D2T            __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 LC3G4D2T_bit        BANKMASK(CLC3GLS3), 3
// CLC3GLS3<LC3G4D3N>
extern volatile __bit                   LC3G4D3N            __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 LC3G4D3N_bit        BANKMASK(CLC3GLS3), 4
// CLC3GLS3<LC3G4D3T>
extern volatile __bit                   LC3G4D3T            __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 LC3G4D3T_bit        BANKMASK(CLC3GLS3), 5
// CLC3GLS3<LC3G4D4N>
extern volatile __bit                   LC3G4D4N            __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 LC3G4D4N_bit        BANKMASK(CLC3GLS3), 6
// CLC3GLS3<LC3G4D4T>
extern volatile __bit                   LC3G4D4T            __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 LC3G4D4T_bit        BANKMASK(CLC3GLS3), 7
// CLC3POL<LC3G4POL>
extern volatile __bit                   LC3G4POL            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 LC3G4POL_bit        BANKMASK(CLC3POL), 3
// CLC3CON<LC3INTN>
extern volatile __bit                   LC3INTN             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 LC3INTN_bit         BANKMASK(CLC3CON), 3
// CLC3CON<LC3INTP>
extern volatile __bit                   LC3INTP             __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 LC3INTP_bit         BANKMASK(CLC3CON), 4
// CLC3CON<LC3MODE0>
extern volatile __bit                   LC3MODE0            __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 LC3MODE0_bit        BANKMASK(CLC3CON), 0
// CLC3CON<LC3MODE1>
extern volatile __bit                   LC3MODE1            __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 LC3MODE1_bit        BANKMASK(CLC3CON), 1
// CLC3CON<LC3MODE2>
extern volatile __bit                   LC3MODE2            __at(0x7902);	// @ (0xF20 * 8 + 2)
#define                                 LC3MODE2_bit        BANKMASK(CLC3CON), 2
// CLC3CON<LC3OE>
extern volatile __bit                   LC3OE               __at(0x7906);	// @ (0xF20 * 8 + 6)
#define                                 LC3OE_bit           BANKMASK(CLC3CON), 6
// CLC3CON<LC3OUT>
extern volatile __bit                   LC3OUT              __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 LC3OUT_bit          BANKMASK(CLC3CON), 5
// CLC3POL<LC3POL>
extern volatile __bit                   LC3POL              __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 LC3POL_bit          BANKMASK(CLC3POL), 7
// CLC4SEL0<LC4D1S0>
extern volatile __bit                   LC4D1S0             __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 LC4D1S0_bit         BANKMASK(CLC4SEL0), 0
// CLC4SEL0<LC4D1S1>
extern volatile __bit                   LC4D1S1             __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 LC4D1S1_bit         BANKMASK(CLC4SEL0), 1
// CLC4SEL0<LC4D1S2>
extern volatile __bit                   LC4D1S2             __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 LC4D1S2_bit         BANKMASK(CLC4SEL0), 2
// CLC4SEL0<LC4D2S0>
extern volatile __bit                   LC4D2S0             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 LC4D2S0_bit         BANKMASK(CLC4SEL0), 4
// CLC4SEL0<LC4D2S1>
extern volatile __bit                   LC4D2S1             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 LC4D2S1_bit         BANKMASK(CLC4SEL0), 5
// CLC4SEL0<LC4D2S2>
extern volatile __bit                   LC4D2S2             __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 LC4D2S2_bit         BANKMASK(CLC4SEL0), 6
// CLC4SEL1<LC4D3S0>
extern volatile __bit                   LC4D3S0             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 LC4D3S0_bit         BANKMASK(CLC4SEL1), 0
// CLC4SEL1<LC4D3S1>
extern volatile __bit                   LC4D3S1             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 LC4D3S1_bit         BANKMASK(CLC4SEL1), 1
// CLC4SEL1<LC4D3S2>
extern volatile __bit                   LC4D3S2             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 LC4D3S2_bit         BANKMASK(CLC4SEL1), 2
// CLC4SEL1<LC4D4S0>
extern volatile __bit                   LC4D4S0             __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 LC4D4S0_bit         BANKMASK(CLC4SEL1), 4
// CLC4SEL1<LC4D4S1>
extern volatile __bit                   LC4D4S1             __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 LC4D4S1_bit         BANKMASK(CLC4SEL1), 5
// CLC4SEL1<LC4D4S2>
extern volatile __bit                   LC4D4S2             __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 LC4D4S2_bit         BANKMASK(CLC4SEL1), 6
// CLC4CON<LC4EN>
extern volatile __bit                   LC4EN               __at(0x7947);	// @ (0xF28 * 8 + 7)
#define                                 LC4EN_bit           BANKMASK(CLC4CON), 7
// CLC4GLS0<LC4G1D1N>
extern volatile __bit                   LC4G1D1N            __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 LC4G1D1N_bit        BANKMASK(CLC4GLS0), 0
// CLC4GLS0<LC4G1D1T>
extern volatile __bit                   LC4G1D1T            __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 LC4G1D1T_bit        BANKMASK(CLC4GLS0), 1
// CLC4GLS0<LC4G1D2N>
extern volatile __bit                   LC4G1D2N            __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 LC4G1D2N_bit        BANKMASK(CLC4GLS0), 2
// CLC4GLS0<LC4G1D2T>
extern volatile __bit                   LC4G1D2T            __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 LC4G1D2T_bit        BANKMASK(CLC4GLS0), 3
// CLC4GLS0<LC4G1D3N>
extern volatile __bit                   LC4G1D3N            __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 LC4G1D3N_bit        BANKMASK(CLC4GLS0), 4
// CLC4GLS0<LC4G1D3T>
extern volatile __bit                   LC4G1D3T            __at(0x7965);	// @ (0xF2C * 8 + 5)
#define                                 LC4G1D3T_bit        BANKMASK(CLC4GLS0), 5
// CLC4GLS0<LC4G1D4N>
extern volatile __bit                   LC4G1D4N            __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 LC4G1D4N_bit        BANKMASK(CLC4GLS0), 6
// CLC4GLS0<LC4G1D4T>
extern volatile __bit                   LC4G1D4T            __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 LC4G1D4T_bit        BANKMASK(CLC4GLS0), 7
// CLC4POL<LC4G1POL>
extern volatile __bit                   LC4G1POL            __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 LC4G1POL_bit        BANKMASK(CLC4POL), 0
// CLC4GLS1<LC4G2D1N>
extern volatile __bit                   LC4G2D1N            __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 LC4G2D1N_bit        BANKMASK(CLC4GLS1), 0
// CLC4GLS1<LC4G2D1T>
extern volatile __bit                   LC4G2D1T            __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 LC4G2D1T_bit        BANKMASK(CLC4GLS1), 1
// CLC4GLS1<LC4G2D2N>
extern volatile __bit                   LC4G2D2N            __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 LC4G2D2N_bit        BANKMASK(CLC4GLS1), 2
// CLC4GLS1<LC4G2D2T>
extern volatile __bit                   LC4G2D2T            __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 LC4G2D2T_bit        BANKMASK(CLC4GLS1), 3
// CLC4GLS1<LC4G2D3N>
extern volatile __bit                   LC4G2D3N            __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 LC4G2D3N_bit        BANKMASK(CLC4GLS1), 4
// CLC4GLS1<LC4G2D3T>
extern volatile __bit                   LC4G2D3T            __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 LC4G2D3T_bit        BANKMASK(CLC4GLS1), 5
// CLC4GLS1<LC4G2D4N>
extern volatile __bit                   LC4G2D4N            __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 LC4G2D4N_bit        BANKMASK(CLC4GLS1), 6
// CLC4GLS1<LC4G2D4T>
extern volatile __bit                   LC4G2D4T            __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 LC4G2D4T_bit        BANKMASK(CLC4GLS1), 7
// CLC4POL<LC4G2POL>
extern volatile __bit                   LC4G2POL            __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 LC4G2POL_bit        BANKMASK(CLC4POL), 1
// CLC4GLS2<LC4G3D1N>
extern volatile __bit                   LC4G3D1N            __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 LC4G3D1N_bit        BANKMASK(CLC4GLS2), 0
// CLC4GLS2<LC4G3D1T>
extern volatile __bit                   LC4G3D1T            __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 LC4G3D1T_bit        BANKMASK(CLC4GLS2), 1
// CLC4GLS2<LC4G3D2N>
extern volatile __bit                   LC4G3D2N            __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 LC4G3D2N_bit        BANKMASK(CLC4GLS2), 2
// CLC4GLS2<LC4G3D2T>
extern volatile __bit                   LC4G3D2T            __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 LC4G3D2T_bit        BANKMASK(CLC4GLS2), 3
// CLC4GLS2<LC4G3D3N>
extern volatile __bit                   LC4G3D3N            __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 LC4G3D3N_bit        BANKMASK(CLC4GLS2), 4
// CLC4GLS2<LC4G3D3T>
extern volatile __bit                   LC4G3D3T            __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 LC4G3D3T_bit        BANKMASK(CLC4GLS2), 5
// CLC4GLS2<LC4G3D4N>
extern volatile __bit                   LC4G3D4N            __at(0x7976);	// @ (0xF2E * 8 + 6)
#define                                 LC4G3D4N_bit        BANKMASK(CLC4GLS2), 6
// CLC4GLS2<LC4G3D4T>
extern volatile __bit                   LC4G3D4T            __at(0x7977);	// @ (0xF2E * 8 + 7)
#define                                 LC4G3D4T_bit        BANKMASK(CLC4GLS2), 7
// CLC4POL<LC4G3POL>
extern volatile __bit                   LC4G3POL            __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 LC4G3POL_bit        BANKMASK(CLC4POL), 2
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 LC4G4D1N_bit        BANKMASK(CLC4GLS3), 0
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 LC4G4D1T_bit        BANKMASK(CLC4GLS3), 1
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 LC4G4D2N_bit        BANKMASK(CLC4GLS3), 2
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0x797B);	// @ (0xF2F * 8 + 3)
#define                                 LC4G4D2T_bit        BANKMASK(CLC4GLS3), 3
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0x797C);	// @ (0xF2F * 8 + 4)
#define                                 LC4G4D3N_bit        BANKMASK(CLC4GLS3), 4
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0x797D);	// @ (0xF2F * 8 + 5)
#define                                 LC4G4D3T_bit        BANKMASK(CLC4GLS3), 5
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0x797E);	// @ (0xF2F * 8 + 6)
#define                                 LC4G4D4N_bit        BANKMASK(CLC4GLS3), 6
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 LC4G4D4T_bit        BANKMASK(CLC4GLS3), 7
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 LC4G4POL_bit        BANKMASK(CLC4POL), 3
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 LC4INTN_bit         BANKMASK(CLC4CON), 3
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 LC4INTP_bit         BANKMASK(CLC4CON), 4
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 LC4MODE0_bit        BANKMASK(CLC4CON), 0
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 LC4MODE1_bit        BANKMASK(CLC4CON), 1
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 LC4MODE2_bit        BANKMASK(CLC4CON), 2
// CLC4CON<LC4OE>
extern volatile __bit                   LC4OE               __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 LC4OE_bit           BANKMASK(CLC4CON), 6
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 LC4OUT_bit          BANKMASK(CLC4CON), 5
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 LC4POL_bit          BANKMASK(CLC4POL), 7
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          BANKMASK(OSCSTAT), 1
// PMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            BANKMASK(PMCON1), 5
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          BANKMASK(CMOUT), 0
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          BANKMASK(CMOUT), 1
// CLCDATA<MCLC1OUT>
extern volatile __bit                   MCLC1OUT            __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 MCLC1OUT_bit        BANKMASK(CLCDATA), 0
// CLCDATA<MCLC2OUT>
extern volatile __bit                   MCLC2OUT            __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 MCLC2OUT_bit        BANKMASK(CLCDATA), 1
// CLCDATA<MCLC3OUT>
extern volatile __bit                   MCLC3OUT            __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 MCLC3OUT_bit        BANKMASK(CLCDATA), 2
// CLCDATA<MCLC4OUT>
extern volatile __bit                   MCLC4OUT            __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 MCLC4OUT_bit        BANKMASK(CLCDATA), 3
// NCO1CLK<N1CKS0>
extern volatile __bit                   N1CKS0              __at(0x24F8);	// @ (0x49F * 8 + 0)
#define                                 N1CKS0_bit          BANKMASK(NCO1CLK), 0
// NCO1CLK<N1CKS1>
extern volatile __bit                   N1CKS1              __at(0x24F9);	// @ (0x49F * 8 + 1)
